In [1]:
import pandas as pd

In [4]:
dict1 = {'name':['Archie', 'Jughead', 'Betty', 'Victoria'],
        'age':[15, 16, 17, 16],
        'gender':['Male', 'Male', 'Female', 'Female']}
dict1

{'age': [15, 16, 17, 16],
 'gender': ['Male', 'Male', 'Female', 'Female'],
 'name': ['Archie', 'Jughead', 'Betty', 'Victoria']}

In [6]:
# Convert dictioanry to DataFrame
df1 = pd.DataFrame(dict1)
df1

   age  gender      name
0   15    Male    Archie
1   16    Male   Jughead
2   17  Female     Betty
3   16  Female  Victoria

In [9]:
# Select column from DataFrame
df1[['name']]

       name
0    Archie
1   Jughead
2     Betty
3  Victoria

In [14]:
# Select multiple columns from DataFrame
df1[['name','gender']]

       name  gender
0    Archie    Male
1   Jughead    Male
2     Betty  Female
3  Victoria  Female

In [18]:
# Selecting a particular row in 
a DataFrame, using the index_name of the row.
df1_renamed = pd.DataFrame({'name':['Archie', 'Jughead', 'Betty', 'Victoria'],
        'age':[15, 16, 17, 16],
        'gender':['Male', 'Male', 'Female', 'Female'],
                           "index":['a', 'b', 'c', 'd']})
df1_renamed

   age  gender index      name
0   15    Male     a    Archie
1   16    Male     b   Jughead
2   17  Female     c     Betty
3   16  Female     d  Victoria

In [20]:
# Renaming columns in Dataframe
df1_renamed = df1.rename(columns={'name':'Name',
                                 'age':'Age',
                                 'gender':'Gender'})
df1_renamed

   Age  Gender      Name
0   15    Male    Archie
1   16    Male   Jughead
2   17  Female     Betty
3   16  Female  Victoria

In [21]:
# Insert new columns in the given index
df1.insert(2, 'age doubled', df1['age'] * 2)
df1

   age  gender  age doubled      name
0   15    Male           30    Archie
1   16    Male           32   Jughead
2   17  Female           34     Betty
3   16  Female           32  Victoria